Tekla Open API Reference for Tekla Structures 2025
DrawingEnumerator Methods
The DrawingEnumerator type exposes the following members.
Methods
Name | Description
GetEnumerator
 Allows the usage of the foreach statement with DrawingObjectEnumerator.
 (Inherited from DrawingEnumeratorBase.)
GetSize
 Returns the total amout of items.
 (Inherited from DrawingEnumeratorBase.)
MoveNext
 Moves to the next item in the enumerator.
 (Inherited from DrawingEnumeratorBase.)
Reset
 Resets the enumerator to the beginning.
 (Inherited from DrawingEnumeratorBase.)
Top
See Also
Reference
DrawingEnumerator Class
Tekla.Structures.Drawing Namespace